       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ************************************
      * AREA DE COMENTÁRIOS - REMARKS
      * AUTHOR = JOAO RIUTO
      * OBJETIVO: MOSTRAR A STRING HELLO ALURA
      * DATA:
      ************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY
           'HELLO ALURA'
           END-DISPLAY.
           STOP RUN.
