       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
      ************************************
      * AREA DE COMENTÁRIOS - REMARKS
      * AUTHOR = JOAO RIUTO
      * OBJETIVO: RECEBER NOME E SALARIO - IMPRIMIR FORMATADO - USO VIRGULA
      * DATA:
      ************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME       PICTURE X(20)       VALUE SPACES.
       77 WRK-SALARIO    PICTURE 9(06)V99    VALUE ZEROS.
       77 WRK-SALARIO-ED PICTURE $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NOME    FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ************ MOSTRAR DADOS ***********
       MOVE WRK-SALARIO TO WRK-SALARIO-ED.
           DISPLAY
           "NOME: " WRK-NOME "SALARIO: " WRK-SALARIO-ED
           END-DISPLAY.
           STOP RUN.
