       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB03.
      ************************************
      * AREA DE COMENTÁRIOS - REMARKS
      * AUTHOR = JOAO RIUTO
      * OBJETIVO: RECEBER E IMPRIMIR A DATA DO SISTEMA
      * UTILIZAR VARIAVEIS NIVEL 01. 02... (ESTRUTURADA)
      * DATA:
      ************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-DATA.
           02 WRK-ANO PICTURE 9(04) VALUE ZEROS.
           02 WRK-MES PICTURE 9(02) VALUE ZEROS.
           02 WRK-DIA PICTURE 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY
           'DATA ATUALIZADA: ' 'HOJE É DIA ' WRK-DIA ' DO MES ' WRK-MES
           ' DO ANO DE ' WRK-ANO
           END-DISPLAY.
           STOP RUN.
